package cn.farwalker.ravv.common.constants;

public enum WeappSenceEnum {
	S1101("1001","发现栏小程序主入口"),
	S1105("1005"," 顶部搜索框的搜索结果页"),
	S1106("1006","发现栏小程序主入口搜索框的搜索结果页"),
	S1107("1007","单人聊天会话中的小程序消息卡片"),
	S1108("1008","群聊会话中的小程序消息卡片"),
	S1011("1011","扫描二维码"),
	S1012("1012","长按图片识别二维码"),
	S1013("1013","手机相册选取二维码"),
	S1014("1014","小程序模版消息"),
	S1017("1017","前往体验版的入口页"),
	S1019("1019","微信钱包"),
	S1020("1020","公众号 profile 页相关小程序列表"),
	S1022("1022"," 聊天顶部置顶小程序入口"),
	S1023("1023","安卓系统桌面图标"),
	S1024("1024","小程序 profile 页"),
	S1025("1025","扫描一维码"),
	S1028("1028","我的卡包"),
	S1029("1029","卡券详情页"),
	S1031("1031","长按图片识别一维码"),
	S1032("1032","手机相册选取一维码"),
	S1034("1034","微信支付完成页"),
	S1035("1035","公众号自定义菜单"),
	S1036("1036","App分享消息卡片"),
	S1042("1042","添加好友搜索框的搜索结果页"),
	S1043("1043","公众号模板消息"),
	S1044("1044"," 群聊会话中的小程序消息卡片（带 shareTicket）"),
	S1047("1047","扫描小程序码"),
	S1048("1048","长按图片识别小程序码"),
	S1049("1049","手机相册选取小程序码"),
	S1052("1052",""),
	S1053("1053",""),
	S1054("1054",""),
	S1056("1056",""),
	S1057("1057",""),
	S1058("1058",""),
	S1059("1059",""),
	S1064("1064",""),
	S1067("1067",""),
	S1068("1068",""),
	S1071("1071",""),
	S1072("1072",""),
	S1073("1073",""),
	S1074("1074",""),
	S1078("1078",""),
	S1089("1089",""),
	S1090("1090",""),
	S1092("1092","");
	
	private String key;
	private String desc;
	
	WeappSenceEnum(String key, String desc){
		this.key = key;
		this.desc = desc;
	}
	
	public String getKey() {
		return key;
	}


	public String getDesc() {
		return desc;
	}

	public static boolean validateSenceStatus(String status) {
		WeappSenceEnum[] arr = WeappSenceEnum.values();
        for (WeappSenceEnum tmp : arr) {
            if (tmp.getKey().equals(status)) {
                return true;
            }
        }
        return false;
    }
}

